# -*- org-confirm-babel-evaluate: nil -*-
#+OPTIONS: ^:nil

* No session
  :PROPERTIES:
  :ID:       37bab689-027c-4189-9abc-9a993da1c099
  :END:
** return type
   :PROPERTIES:
   :ID:       977ba858-a4aa-4108-8e61-43dd880d5b08
   :END:
   #+NAME: ns-rt-value
   #+BEGIN_SRC hy :results value
     "ob-hy"
   #+END_SRC

   #+RESULTS: ns-rt-value
   : ob-hy

   #+NAME: ns-rt-output
   #+BEGIN_SRC hy :results output
     (print "ob-hy")
   #+END_SRC

   #+RESULTS: ns-rt-output
   : ob-hy

** variable
   :PROPERTIES:
   :ID:       1f5d82ee-93a4-4821-85fb-c855188beb65
   :END:

    #+NAME: ns-variable-int
    #+BEGIN_SRC hy :results value :var x=5
      x
    #+END_SRC

    #+RESULTS: ns-variable-int
    : 5

    #+NAME: ns-variable-str
    #+BEGIN_SRC hy :results value :var str="ob-hy"
      str
    #+END_SRC

    #+RESULTS: ns-variable-str
    : ob-hy

    #+NAME: ns-variable-list
    #+BEGIN_SRC hy :results value raw :var list='("a" "b" "c")
      list
    #+END_SRC

    #+RESULTS: ns-variable-list
    (u'a' u'b' u'c')

    #+NAME: num-tb
    | 1 | 2 |
    |---+---|
    | 3 | 4 |

    #+NAME: ns-variable-tb
    #+BEGIN_SRC hy :results value raw :var tb=num-tb :colnames no
      tb
    #+END_SRC

    #+RESULTS: ns-variable-tb
    ((1L 2L) (3L 4L))

    #+NAME: ns-multi-variables
    #+BEGIN_SRC hy :results value :var x=3 y=4 z=5
      (+ x y z)
    #+END_SRC

    #+RESULTS: ns-multi-variables
    : 12

* Session
  :PROPERTIES:
  :ID:       fe04c2ad-1df7-4708-aca7-3f139e854f88
  :END:

** return type
   :PROPERTIES:
   :ID:       9b2000b6-97e1-4015-9db9-f97e39d82bf2
   :END:
   #+NAME: s-rt-value
   #+BEGIN_SRC hy :results value :session
     "ob-hy"
   #+END_SRC

   #+RESULTS: s-rt-value
   : ob-hy

   #+NAME: s-rt-output
   #+BEGIN_SRC hy :results output :session
     (print "ob-hy")
   #+END_SRC

   #+RESULTS: s-rt-output
   : ob-hy

   #+BEGIN_SRC elisp :results value
     (replace-regexp-in-string "=> " "" "=> => => ob-hy")
   #+END_SRC

   #+RESULTS:
   : ob-hy

** variable
   :PROPERTIES:
   :ID:       4f83532c-0db3-4b39-8c91-b83bc106ee64
   :END:

   #+NAME: s-variable-int
   #+BEGIN_SRC hy :results value :var x=5 :session
     x
   #+END_SRC

   #+RESULTS: s-variable-int
   : 5

   #+NAME: s-variable-str
   #+BEGIN_SRC hy :results value :var strVar="ob-hy" :session
     strVar
   #+END_SRC

   #+RESULTS: s-variable-str
   : ob-hy

    #+NAME: s-variable-list
    #+BEGIN_SRC hy :results value raw :var list='("a" "b" "c") :session
      list
    #+END_SRC

    #+RESULTS: s-variable-list
    (u'a' u'b' u'c')

    #+NAME: s-variable-tb
    #+BEGIN_SRC hy :results value raw :var tb=num-tb :colnames no :session
      tb
    #+END_SRC

    #+RESULTS: s-variable-tb
    ((1L 2L) (3L 4L))

    #+NAME: s-multi-variables
    #+BEGIN_SRC hy :results value :var x=3 y=4 z=5 :session
      (+ x y z)
    #+END_SRC

    #+RESULTS: s-multi-variables
    : 12

* Test
  :PROPERTIES:
  :ID:       0f17afd6-27b4-4186-aeb5-e0dd2b99a8fc
  :END:

  #+NAME: ob-hy-tests
  | functionality                     | block              | arg | expected      | results             | pass                                                               |
  |-----------------------------------+--------------------+-----+---------------+---------------------+--------------------------------------------------------------------|
  | return-type   : no session value  | ns-rt-value        |     | ob-hy         | ob-hy               | pass                                                               |
  | return-type   : no session output | ns-rt-output       |     | ob-hy         | ob-hy               | pass                                                               |
  | variable-int  : no session        | ns-variable-int    |     | 5             | 5                   | pass                                                               |
  | variable-str  : no session        | ns-variable-str    |     | ob-hy         | ob-hy               | pass                                                               |
  | variable-list : no session        | ns-variable-list   |     | ("a" "b" "c") | (u "a" u "b" u "c") | expected "(\"a\" \"b\" \"c\")" but was "(u \"a\" u \"b\" u \"c\")" |
  | variable-tb   : no session        | ns-variable-tb     |     | ((1 2) (3 4)) | ((1L 2L) (3L 4L))   | expected "((1 2) (3 4))" but was "((1L 2L) (3L 4L))"               |
  | variable-multi: no session        | ns-multi-variables |     | 12            | 12                  | pass                                                               |
  #+TBLFM: $5='(org-sbe $2) :: $6='(if (string= $4 $5) "pass" (format "expected %S but was %S" $4 $5))
